## 데이터 프레임 복습

In [1]:
# 데이터 프레임 생성 
import pandas as pd

In [2]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
type(df)

pandas.core.frame.DataFrame

In [3]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [14]:
a = [[1, 4, 7], [2, 5, 8], [3, 6, 9]]
a

[[1, 4, 7], [2, 5, 8], [3, 6, 9]]

In [15]:
df2 = pd.DataFrame(a)
df2

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [9]:
df2.columns = ['a', 'b', 'c']
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [10]:
df3 = pd.DataFrame({'company' : ['abc', '회사', '123'], '직원수' : [400, 10, 6]})
df3

  company  직원수
0     abc  400
1      회사   10
2     123    6

In [11]:
import numpy as np
df3['위치'] = ['Seoul', np.nan, 'Busan']
df3

  company  직원수     위치
0     abc  400  Seoul
1      회사   10    NaN
2     123    6  Busan

In [17]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [18]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [19]:
df.columns[1]

'b'

In [20]:
df.columns = ['d', 'e', 'f']
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

In [21]:
df.columns = ['디', 'e', '에프']
df

   디  e  에프
0  1  4   7
1  2  5   8
2  3  6   9

In [22]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [24]:
df.rename(columns ={'a' : '디', 'c' : '에프'}, inplace = True)
df

   디  b  에프
0  1  4   7
1  2  5   8
2  3  6   9

In [27]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})

In [28]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [29]:
df.rename(columns = {'a' : '에이'}, inplace = True)

In [30]:
df

   에이  b  c
0   1  4  7
1   2  5  8
2   3  6  9

In [31]:
import copy

In [32]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
df2 = copy.deepcopy(df)
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [33]:
df2.columns = ['d', 'e', 'f']

In [34]:
df, df2

(   a  b  c
 0  1  4  7
 1  2  5  8
 2  3  6  9,
    d  e  f
 0  1  4  7
 1  2  5  8
 2  3  6  9)

In [35]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})

In [36]:
df['a']

0    1
1    2
2    3
Name: a, dtype: int64

In [37]:
type(df['a'])

pandas.core.series.Series

In [38]:
a = pd.Series([1, 2, 3, 1, 2, 3])
a

0    1
1    2
2    3
3    1
4    2
5    3
dtype: int64

In [39]:
a = pd.Series([1, 2, 3, 1, 2, 3], index = ['a', 'b', 'c', 'd', 'e', 'f'])
a

a    1
b    2
c    3
d    1
e    2
f    3
dtype: int64

In [40]:
a['e']

2

In [41]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [42]:
a = df['a']
a

0    1
1    2
2    3
Name: a, dtype: int64

In [43]:
a.unique()

array([1, 2, 3], dtype=int64)

In [45]:
df[['a', 'b']]

   a  b
0  1  4
1  2  5
2  3  6

In [47]:
# loc, iloc   
df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11, 21)], 'c' : [i for i in range(21, 31)]})
df

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

In [48]:
df[['a', 'b']]

    a   b
0   1  11
1   2  12
2   3  13
3   4  14
4   5  15
5   6  16
6   7  17
7   8  18
8   9  19
9  10  20

In [51]:
df.loc[0]

a     1
b    11
c    21
Name: 0, dtype: int64

In [52]:
df.loc[2 : 4]

   a   b   c
2  3  13  23
3  4  14  24
4  5  15  25

In [72]:
index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'g', 'h', 'i']
df.index = index
df

    a   b   c
a   1  11  21
b   2  12  22
c   3  13  23
d   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

In [59]:
df.loc['g']

   a   b   c
g  7  17  27
g  8  18  28

In [60]:
df.loc['c' : ]

    a   b   c
c   3  13  23
d   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

In [73]:
df.loc[['g', 'i'], ['a', 'c']]

    a   c
g   7  27
g   8  28
i  10  30

In [74]:
df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11, 21)], 'c' : [i for i in range(21, 31)]})
df.iloc[ : 5, [0, 2]]

   a   c
0  1  21
1  2  22
2  3  23
3  4  24
4  5  25

In [75]:
index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'g', 'h', 'i']
df.index = index
df

    a   b   c
a   1  11  21
b   2  12  22
c   3  13  23
d   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

In [76]:
df.iloc[ : 5, [0, 2]]

   a   c
a  1  21
b  2  22
c  3  23
d  4  24
e  5  25

In [77]:
df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11, 21)], 'c' : [i for i in range(21, 31)]})
df

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

In [78]:
df.loc[ : , ['a', 'c']]

    a   c
0   1  21
1   2  22
2   3  23
3   4  24
4   5  25
5   6  26
6   7  27
7   8  28
8   9  29
9  10  30

In [79]:
df.loc[df['a'] >= 3]

    a   b   c
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

In [80]:
df.loc[df['a'] >= 3, ['a', 'c']]

    a   c
2   3  23
3   4  24
4   5  25
5   6  26
6   7  27
7   8  28
8   9  29
9  10  30

In [84]:
df.loc[(df['a'] >= 3) & (df['b'] < 16)]

   a   b   c
2  3  13  23
3  4  14  24
4  5  15  25

In [85]:
df.loc[(df['a'] <= 3) | (df['a'] >= 7)]

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

In [86]:
df.loc[(df['a'] >= 3) & ((df['b'] < 16) | (df['c'] == 30))]

    a   b   c
2   3  13  23
3   4  14  24
4   5  15  25
9  10  20  30

In [87]:
df = pd.DataFrame({'a' : [2, 3, 2, 7, 4], 'b' : [2, 1, 3, 5, 3], 'c' : [1, 1, 2, 3, 5]})
df

   a  b  c
0  2  2  1
1  3  1  1
2  2  3  2
3  7  5  3
4  4  3  5

In [90]:
df.sort_index(ascending = False, inplace = True)

In [94]:
df.reset_index(drop=True, inplace = True)

In [95]:
df

   a  b  c
0  4  3  5
1  7  5  3
2  2  3  2
3  3  1  1
4  2  2  1

In [96]:
df = pd.DataFrame({'a' : [2, 3, 2, 7, 4], 'b' : [2, 1, 3, 5, 3], 'c' : [1, 1, 2, 3, 5]})

In [99]:
df.sort_values(by = ['a'], inplace = True)

In [100]:
df

   a  b  c
0  2  2  1
2  2  3  2
1  3  1  1
4  4  3  5
3  7  5  3

In [101]:
df.sort_values(by = ['a'], ascending = False, inplace = True)
df

   a  b  c
3  7  5  3
4  4  3  5
1  3  1  1
0  2  2  1
2  2  3  2

In [102]:
df.sort_values(by = ['a', 'b'])

   a  b  c
0  2  2  1
2  2  3  2
1  3  1  1
4  4  3  5
3  7  5  3

In [104]:
df.sort_values(by=['a', 'b'], ascending=[True, False], inplace = True)

In [107]:
df.reset_index(drop = True, inplace = True)

In [108]:
df

   a  b  c
0  2  3  2
1  2  2  1
2  3  1  1
3  4  3  5
4  7  5  3

In [109]:
df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, np.nan, 3, 4], 'c' : [3, 4, 7, 6, 4]})
df

   a    b  c
0  1  2.0  3
1  1  3.0  4
2  3  NaN  7
3  4  3.0  6
4  5  4.0  4

In [110]:
df.isnull()

       a      b      c
0  False  False  False
1  False  False  False
2  False   True  False
3  False  False  False
4  False  False  False

In [112]:
df.isnull().sum()

a    0
b    1
c    0
dtype: int64

In [113]:
df.dropna()

   a    b  c
0  1  2.0  3
1  1  3.0  4
3  4  3.0  6
4  5  4.0  4

In [115]:
df.dropna(inplace = True)

In [116]:
df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, np.nan, 3, 4], 'c' : [3, 4, 7, 6, 4]})

In [117]:
df.dropna(axis = 1)

   a  c
0  1  3
1  1  4
2  3  7
3  4  6
4  5  4

In [118]:
df

   a    b  c
0  1  2.0  3
1  1  3.0  4
2  3  NaN  7
3  4  3.0  6
4  5  4.0  4

In [119]:
df.fillna(0, inplace = True)
df

   a    b  c
0  1  2.0  3
1  1  3.0  4
2  3  0.0  7
3  4  3.0  6
4  5  4.0  4

In [121]:
df = pd.DataFrame({'a' : [1, 1, 3, 4, np.nan], 'b' : [2, 3, np.nan, np.nan, 4], 'c' : [np.nan, 4, 7, 6, 4]})
df

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  NaN  7.0
3  4.0  NaN  6.0
4  NaN  4.0  4.0

In [122]:
df.fillna(method = 'bfill')

     a    b    c
0  1.0  2.0  4.0
1  1.0  3.0  4.0
2  3.0  4.0  7.0
3  4.0  4.0  6.0
4  NaN  4.0  4.0

In [123]:
df.fillna(method = 'ffill')

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  3.0  7.0
3  4.0  3.0  6.0
4  4.0  4.0  4.0

In [124]:
df.fillna(method = 'ffill', limit = 1)

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  3.0  7.0
3  4.0  NaN  6.0
4  4.0  4.0  4.0

In [125]:
df

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  NaN  7.0
3  4.0  NaN  6.0
4  NaN  4.0  4.0

In [126]:
df.fillna(df.mean())

      a    b     c
0  1.00  2.0  5.25
1  1.00  3.0  4.00
2  3.00  3.0  7.00
3  4.00  3.0  6.00
4  2.25  4.0  4.00

In [128]:
df = pd.DataFrame({'판매일' : ['5/11/21', '5/12/21', '5/13/21', '5/14/21', '5/15/21'],
                    '판매량' : ['10', '15', '20', '25', '30'],
                    '방문자수' : ['10', '-', '17', '23', '25'],
                    '기온' : ['24.1', '24.3', '24.8', '25', '25.4']})
df

       판매일 판매량 방문자수    기온
0  5/11/21  10   10  24.1
1  5/12/21  15    -  24.3
2  5/13/21  20   17  24.8
3  5/14/21  25   23    25
4  5/15/21  30   25  25.4

In [133]:
df.dtypes

판매일     object
판매량      int32
방문자수    object
기온      object
dtype: object

In [132]:
df = df.astype({'판매량' : 'int'})

In [139]:
df['방문자수'] = pd.to_numeric(df['방문자수'], errors='coerce')

In [140]:
df

       판매일  판매량  방문자수    기온
0  5/11/21   10  10.0  24.1
1  5/12/21   15   NaN  24.3
2  5/13/21   20  17.0  24.8
3  5/14/21   25  23.0    25
4  5/15/21   30  25.0  25.4

In [141]:
df.fillna(0, inplace=True)
df = df.astype({'방문자수' : 'int'})

In [142]:
df

       판매일  판매량  방문자수    기온
0  5/11/21   10    10  24.1
1  5/12/21   15     0  24.3
2  5/13/21   20    17  24.8
3  5/14/21   25    23    25
4  5/15/21   30    25  25.4

In [146]:
df['판매일'] = pd.to_datetime(df['판매일'], format = '%m/%d/%y')
df

         판매일  판매량  방문자수    기온
0 2021-05-11   10    10  24.1
1 2021-05-12   15     0  24.3
2 2021-05-13   20    17  24.8
3 2021-05-14   25    23    25
4 2021-05-15   30    25  25.4

In [147]:
df.dtypes

판매일     datetime64[ns]
판매량              int32
방문자수             int32
기온              object
dtype: object

In [148]:
df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, 2, 3, 4], 'c' : [3, 4, 7, 6, 4]})
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4

In [149]:
df['d'] = [1, 3, 6, 4, 8]
df

   a  b  c  d
0  1  2  3  1
1  1  3  4  3
2  3  2  7  6
3  4  3  6  4
4  5  4  4  8

In [151]:
df['e'] = 1

In [152]:
df

   a  b  c  d  e
0  1  2  3  1  1
1  1  3  4  3  1
2  3  2  7  6  1
3  4  3  6  4  1
4  5  4  4  8  1

In [157]:
df.drop(['d', 'e'], axis = 1, inplace = True)

In [158]:
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4

In [162]:
df = df.append({'a' : 6, 'b' : 7, 'c' : 8}, ignore_index = True)

C:\Users\94dng\AppData\Local\Temp\ipykernel_3456\2980971988.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'a' : 6, 'b' : 7, 'c' : 8}, ignore_index = True)

In [163]:
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4
5  6  7  8

In [164]:
df.loc[6] = [7, 8, 9]

In [165]:
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4
5  6  7  8
6  7  8  9

In [166]:
df = df.drop([0, 1])
df

   a  b  c
2  3  2  7
3  4  3  6
4  5  4  4
5  6  7  8
6  7  8  9

In [167]:
df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, 2, 3, 4], 'c' : [3, 4, 7, 6, 4]})

In [168]:
df.drop([i for i in range(4)])

   a  b  c
4  5  4  4

In [169]:
df.drop(df.index[ : 4])

   a  b  c
4  5  4  4

In [173]:
df.drop(df[df['a'] < 4].index)

   a  b  c
3  4  3  6
4  5  4  4

In [175]:
df.drop(df[(df['a'] < 3) & (df['c'] == 4)].index)

   a  b  c
0  1  2  3
2  3  2  7
3  4  3  6
4  5  4  4

In [176]:
df = pd.DataFrame({'a' : [1, 2, 3, 4, 5]})

In [177]:
df['b'] = 0

In [178]:
def case_function(x):
    if x < 2:
        return '2 미만'
    elif x < 4:
        return '4 미만'
    else:
        return '4 이상'
df['b'] = df['a'].apply(case_function)
df

   a     b
0  1  2 미만
1  2  4 미만
2  3  4 미만
3  4  4 이상
4  5  4 이상